Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །ཆོས་རྣམས་རྣམ་པར་ཕྱེ་ཞིང་ཤིན་ཏུ་སྟོན་པ་བྱེད།
en: And in order to benefit them, illuminate the different kinds of Dharma.

source: །ཐ་དད་ཡང་དག་དོན་ཤེས་ངེས་ཚིག་སྤོབས་པ་ཡིས།
en: They are skilled in special knowledge, meaning, confidence, and etymology.

source: །དེ་དག་ཆོས་སྨྲའི་ཚུལ་ལ་གནས་པ་རབ་ཏུ་ཐོབ།
en: “They have attained the state of a dharmabhāṇaka.

source: །སེང་གེ་ཁྱུ་མཆོག་དཔེ་འདྲ་རི་ཡི་རྒྱལ་པོ་འདྲ།
en: They are like lions, like bulls, and like the king of mountains.

source: །བདུད་རྩི་སྤྲིན་ཆེན་ཞིམ་པའི་ཆར་ཡང་རབ་ཏུ་འབེབས།
en: They cause a delicious rain of nectar to rain down,

source: །ཀླུ་ཡི་རྒྱལ་པོས་རྒྱ་མཚོ་རྒྱས་པར་བྱེད་པ་བཞིན།
en: Just as the king of nāgas fills the ocean.

source: །དོན་གྱི་དོན་ཤེས་དེ་བཞིན་ཆོས་ཉིད་རབ་ཏུ་ཤེས།
en: “They are skilled in knowing the meaning of meanings and thus the true nature.

source: །ངེས་ཚིག་རྗེས་སུ་སོང་ཞིང་སྤོབས་པ་རབ་ཏུ་ཐོབ།
en: They observe etymologies and they have attained eloquence.

source: །དེ་དག་གྲངས་མྱེད་སྟོང་ཕྲག་བཅུ་ཡི་གཟུངས་ཐོབ་པས།
en: They have acquired countless tens of thousands of retentions.

source: །ཆོས་རྣམས་འཛིན་པ་རྒྱ་མཚོ་སྤྲིན་ཆེན་ཆར་འཛིན་བཞིན།
en: They possess the Dharma just as the ocean and great clouds possess rain.

source: །དེ་དག་དེ་འདྲའི་ཏིང་འཛིན་གཟུངས་གསལ་ཐོབ་གྱུར་པས།
en: “They have attained that kind of retention and pure samādhi.

source: །སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་མང་པོ་སྟོང་ཡང་མཐོང་།
en: In one instant they see many tens of thousands of buddhas.

source: །རིན་ཆེན་ཆོས་རྣམས་ཐོབ་ནས་ཡང་དུ་སྟོན་བྱེད་དེ།
en: They hear the precious Dharmas and they teach it.

source: །ཚིག་གི་དཀྱིལ་འཁོར་རྣམ་དག་དབྱངས་ཀྱི་ཡན་ལག་ལྡན།
en: They possess the qualities of speech, the pure domain of words.

source: །འདོད་ན་སྟོང་གསུམ་འཇིག་རྟེན་ཁམས་སུ་གཏོགས་པ་ཡིས།
en: “Through the Three Jewels they bring relief

source: །སེམས་ཅན་བསམ་སེམས་སྣ་ཚོགས་ཚུལ་བཞིན་སྨིན་བྱེད་ཅིང་།
en: To all the different kinds of beings in the billion-world universe

source: །ཐམས་ཅད་བསམ་པ་དབང་པོ་ཇི་བཞིན་ཚིམ་པར་བྱེད།
en: In accordance with their aspirations and dispositions,

source: །གླིང་བཞི་རྒྱ་མཚོའི་སྤྲིན་བཞིན་ཡང་དག་རབ་ཏུ་འཇུག །དེ་བས་གོང་དུ་ལེགས་ལྡན་བརྩོན་འགྲུས་རབ་ཐོབ་པ།
en: Like the ocean and rain bringing joy to the four continents. “They undertake even more than before the quality of diligence.

source: །སྐྲ་རྩེའི་གོ་གཅིག་བསམ་གྱིས་མི་ཁྱབ་སེམས་པ་བྱེད།
en: They contemplate how inconceivably, on a hair tip,

source: །སེམས་ཅན་སྣ་ཚོགས་མང་ལ་བདེ་གཤེགས་ཆོས་སྟོན་པ།
en: Sugatas are teaching the Dharma to many beings.

source: །ཐོས་ནས་ས་བོན་ཀུན་འཛིན་ས་བཞིན་ཡོངས་སུ་འཛིན།
en: Having heard it, they retain it like the earth holds seeds.

source: །ཕྱོགས་རྣམས་བཅུ་པོའི་སེམས་ཅན་མང་པོ་ཇི་སྙེད་པ།
en: “However many beings there are in the ten directions,

source: །དེ་དག་ཐམས་ཅད་འཁོར་གཅིག་འདུས་པར་འཁོད་གྱུར་ཀྱང་།
en: They are all gathered within one assembly,

source: །དེ་དག་བསམ་པ་སྐད་ཅིག་གཅིག་གིས་བསམ་བྱས་ཤིང་།
en: And in one instant he understands them all,

source: །སྒྲ་སྐད་གཅིག་གིས་དེ་དག་ཐམས་ཅད་ཚིམ་པར་བྱེད།
en: And with one sound he satisfies them all.

source: །འདི་ལ་གནས་པ་ཆོས་རྒྱལ་ལྷ་མྱི་མཆོག་ཏུ་འགྱུར།
en: “The Dharma kings on this bhūmi are supreme among humans and devas.

source: །རྒྱལ་བའི་སྲས་པོ་ཆོས་ཀྱིས་ཡོངས་སུ་སྐྱོང་བ་ཡིན།
en: They become bodhisattvas who are moved by the Dharma.

source: །ཉིན་མཚན་ཀུན་ཏུ་རྒྱལ་བ་རྣམས་དང་རྟག་པར་འགྲོགས།
en: Day and night they are continually in the presence of the jinas.

source: །ཟབ་ཡངས་ཡེ་ཤེས་རྣམ་པར་ཐར་པ་ལྡན་པར་གནས།
en: They remain in profound peace, in constant wisdom and liberation.

source: །དེ་དག་དུ་ཡང་སངས་རྒྱས་ཁྲག་ཁྲིག་བསྙེན་བཀུར་བྱེད།
en: “They attend many millions of buddhas.

source: །འཁོར་ལོས་སྒྱུར་བའི་རྒྱན་བཟང་ཡོངས་སུ་བྱང་བ་བཞིན།
en: They become purified like the majestic adornment of a cakravartin.

source: །དེ་ཡི་འོད་ཀྱང་ཉོན་མོངས་ཐིབས་པོ་སྣང་བར་བྱེད།
en: Their radiance overcomes the complexities of the kleśas

source: །ཚངས་པའི་འོད་ཀྱིས་སྟོང་གཉིས་འཇིག་རྟེན་ཇི་བཞིན་ནོ།
en: Like Brahmā illuminating the worlds of two billion-world universes.

source: །འདི་ལ་གནས་པ་ལེགས་ལྡན་ཚངས་ཆེན་འཇིག་རྟེན་དུ།
en: “Possessing qualities, they reside in the realm of great Brahmā.

source: །སྐྱེ་འགྱུར་ཐེག་གསུམ་སྟོན་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ།
en: They become powerful in the knowledge of teaching the three yānas.

source: །འགྲོ་བ་ཀུན་ལ་ཕན་ཕྱིར་ཅི་རྩོམ་གང་ཡང་རུང་།
en: Whatever they undertake is for the benefit of all beings.

source: །ཡོན་ཏན་ཤེས་ལྡན་བདེ་གཤེགས་ཡེ་ཤེས་ལྡན་པར་སྔོ།
en: Intent on omniscient wisdom, they attain qualities and wisdom. “In one instant they attain as many stable samādhis

source: །གྲངས་མེད་ཞིང་དུ་གཏོགས་པ་རྡུལ་ཕྲན་དུ་ཡོད་པ། །དེ་སྙེད་ཏིང་འཛིན་སྐད་ཅིག་གཅིག་ཏུ་བརྟན་པས་འཐོབ།
en: As there are atoms in countless realms.

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་རྒྱལ་བ་མཐོང་ཞིང་གསུང་ཡང་ཉན།
en: They see the jinas in all directions and listen to their speech

source: །ཡན་ཅད་སྨོན་ལམ་ལྡན་པ་ཚད་མེད་རྣམ་པར་འཕྲུལ།
en: And then through their aspiration manifest countless emanations.

source: །འདི་ནི་ས་རབ་དགུ་པ་སྟེ།
en: “This is the ninth bhūmi

source: །ཡེ་ཤེས་ཆེན་པོ་རྣམ་པར་སྤྱོད།
en: Of those with great wisdom. Bodhisattvas, this is a teaching

source: །ཟབ་ཅིང་བལྟ་དཀའ་ཤིན་ཏུ་ཕྲ། །རྒྱལ་བའི་སྲས་ཀྱིས་བསྟན་པ་ཡིན། །ལེགས་པའི་བློ་གྲོས་ཤེས་བྱ་བ་སྟེ།
en: That is profound, difficult to see, and subtle.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པའོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: “That is the ninth bodhisattva bhūmi, Which is called Perfect Understanding.”

source: །བམ་པོ་ཉི་ཤུ་པའོ།
en: A million Śuddhāvāsa devas were delighted

source: །སྤྱོད་པ་བླ་ན་མེད་པ་འདི་ཐོས་ནས། །གཙང་གནས་ལྷ་རྣམས་བྱེ་བ་རབ་ཏུ་དགའ།
en: On hearing of this unsurpassable conduct.

source: །དབང་པོ་ཚིམ་པར་བར་སྣང་མཁའ་ལ་གནས།
en: Their senses pleased, residing in the sky,

source: །བདེ་བར་གཤེགས་ལ་རྗེ་སར་མཆོད་པ་བྱེད།
en: They made offerings to the Sugata, to the Tathāgata.

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བསམ་ཡས་པ།
en: Countless millions of bodhisattvas,

source: །བར་སྣང་མཁའ་གནས་རབ་ཏུ་དགར་གྱུར་ཅིང་།
en: Delighted, residing in the sky,

source: །སྤོས་སྤྲིན་ཚད་མེད་ཡིད་དུ་འོང་བ་དག །འགྲོ་བའི་ཉོན་མོངས་སེལ་བ་དྲི་ཞིམ་བདུག་པ་བྱེད།
en: Released incomparable clouds of pleasant incense That eliminated the kleśas of beings.

source: །ལྷ་ཡི་དབང་པོ་དབང་བསྒྱུར་རབ་དགའ་ཞིང་།
en: The deva king Vaśavartin, pleased,

source: །བར་སྣང་གནས་ལས་ལྷ་འཁོར་ཁྲག་ཁྲིག་དང་། །རིམ་གྲོ་བཅས་པར་གོས་རྣམས་འདོར་བར་བྱེད།
en: In the sky with a retinue of thirty billion devas,

source: །ཡིད་འོང་གོས་བརྒྱ་ཡོངས་སུ་བསྐོར་བ་བྱས།
en: Respectfully scattered hundreds Of beautiful perfect pieces of clothing.

source: །ལྷ་ཡི་བུ་མོ་མང་པོ་ཤིན་ཏུ་དགའ།
en: The goddesses, their senses pleased,

source: །བདེ་བར་གཤེགས་ལ་རྗེས་སུ་མཆོད་པ་བྱེད།
en: Respectfully made offerings to the Sugata

source: །རོལ་མོ་བརྡུང་བ་བྱེ་བ་ཁྲག་ཁྲིག་བྱེད།
en: With the sounds of a quintillion musical instruments,

source: །འདི་འདྲའི་སྒྲ་དབྱངས་ཀུན་ལས་བྱུང་བར་གྱུར།
en: And they sang these words:

source: །ཞིང་མཆོག་གཅིག་ན་བདེ་བར་གཤེགས་པ་བཞུགས།
en: “The Sugata resides in one perfect realm

source: །ཞིང་རྣམས་ཀུན་ཏུ་སྐུ་གཟུགས་རབ་ཏུ་བསྟན།
en: And manifests his body in all realms,

source: །སྐུ་གཟུགས་ཁྲག་ཁྲིག་སྣ་ཚོགས་ཡིད་དུ་འོང་།
en: Millions of beautiful bodies

source: །ཆོས་དབྱིངས་རྒྱ་ཆེན་ཡོངས་སུ་རྒྱས་པར་གང་།
en: That pervade the entire realm of phenomena.

source: །སྤུ་གཅིག་རྩེ་ནས་བདེ་གཤེགས་འོད་བཀྱེ་བ།
en: “The light rays from one of the Sugata’s pores

source: །འགྲོ་བའི་ཉོན་མོངས་ཡོངས་སུ་ཞི་བར་འཕྲོ།
en: Radiate and end the kleśas of beings.

source: །ཞིང་གི་རྡུལ་ཁམས་ཟད་པར་ནུས་འགྱུར་གྱི།
en: One can count the number of atoms in a world,

source: །དེ་དག་བགྲང་བས་ཤེས་པར་མྱི་ནུས་སོ།
en: But the number of the light rays is unknowable.

source: །ལ་ལས་སངས་རྒྱས་མཚན་རབ་མངའ་བར་མཐོང་།
en: “Some are perceived as wise ones with the supreme features

source: །འཁོར་ལོས་སྒྱུར་བའི་དམ་པར་ལ་ལས་མཐོང་།
en: Of a buddha who is turning the supreme wheel.

source: །ཞིང་རྣམས་ལ་ལར་སྤྱོད་པ་མཆོག་མཛད་ཅིང་།
en: In other realms they purify the highest, supreme conduct

source: །དག་ཅིང་ཞི་བར་རྐང་གཉིས་དམ་པ་མཐོང་།
en: And are seen as lords among humans.

source: །དགའ་ལྡན་གནས་ན་མགོན་པོ་བཞུགས་པ་དང་། །འཕོ་དང་གཤེགས་པར་དེ་བཞིན་རབ་ཏུ་སྣང་།
en: “The guide is seen to attain an existence in Tuṣita, Where he passes away and departs.

source: །ཞིང་རྣམས་བྱེ་བར་ཡུམ་གྱི་སྐུར་བཞུགས་དང་། །ཞིང་རྣམས་ལ་ལར་སྐྱེ་བ་དེ་བཞིན་སྣང་།
en: He enters a womb in many tens of millions of worlds, And in those worlds he is seen to be born. “The guide, in order to benefit beings, renounces the world,

source: །འགྲོ་བའི་དོན་དུ་མགོན་པོ་འབྱུང་མཛད་དང་། །བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་འཚང་རྒྱ་ཞིང་།
en: Attains the highest enlightenment, becoming a buddha,

source: །ཆོས་ཀྱི་འཁོར་ལོ་མྱ་ངན་འདའ་བ་དག །ཞིང་མང་ཁྲག་ཁྲིག་ཀུན་ན་དེ་བཞིན་སྣང་།
en: Turns the wheel of the Dharma, and passes into nirvāṇa, This being perceived in many millions of worlds.

source: །སྒྱུ་མའི་མཁན་པོ་མཁས་པར་ལོབས་གྱུར་པ།
en: “Just as a conjurer who is skilled in magic

source: །ཇི་ལྟར་འཚོ་ཕྱིར་གཟུགས་མང་སྟོན་པ་བཞིན།
en: Manifests many bodies to make a livelihood,

source: །དེ་བཞིན་སྟོན་པ་ཡེ་ཤེས་མཆོག་མཁྱེན་པ།
en: The Teacher, who is skilled in supreme wisdom,

source: །སྐུ་གཟུགས་ཀུན་ཏུ་འགྲོ་བ་རྣམས་ལ་སྟོན།
en: Accomplishes all those bodies for beings.

source: །སྟོང་པ་ཞི་བ་རང་བཞིན་མཚན་ཉིད་མྱེད།
en: “He has attained the true nature, which is the same as space,

source: །ཆོས་ཉིད་བར་སྣང་མཁའ་དང་མཉམ་པར་ཡང་།
en: Empty, at peace, and without characteristics.

source: །སངས་རྒྱས་སྟོན་པ་དོན་དམ་དེ་ཉིད་དུ།
en: The Teacher, the Buddha, teaches the true nature of the ultimate truth,

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་མཆོག་གིས་ཡང་དག་བསྟན།
en: The supreme field of activity of a buddha.

source: །བདེ་གཤེགས་སྤྱོད་ཡུལ་རང་བཞིན་ཅི་འདྲ་བ།
en: “Just as is the nature of the field of activity of the Sugata,

source: །སེམས་ཅན་ཀུན་གྱི་ཆོས་ཉིད་དེ་འདྲ་སྟེ།
en: So is the true nature attained by all beings.

source: །མཚན་དང་མཚན་གཞི་མཉམ་པ་ཉིད་ཀྱིས་འདྲ།
en: Just as there is the equal characteristic of characteristics and no characteristics,

source: །མཚན་ཉིད་མེད་པ་ཆོས་རྣམས་ཀུན་གྱི་མཆོག །བདེ་གཤེགས་ཡེ་ཤེས་དོན་དུ་སུ་གཉེར་བས།
en: That is the characteristic of the ultimate truth of all phenomena. “Those whose goal is the wisdom of the sugatas

source: རྟོག་དང་རྣམ་རྟོགས་ཡོད་རྟོག་ཡོངས་སུ་སྤོངས།
en: Should avoid concepts, ideas, and assumptions,

source: །དངོས་དང་དངོས་མེད་མཉམ་ཉིད་ཤེས་པར་གྱིས།
en: Realizing the equal nature of existence and nonexistence,

source: །མྱུར་དུ་མྱི་ཡི་གཙོ་བོ་མཆོག་ཏུ་འགྱུར།
en: And they will quickly become a supreme lord of humans.” With beautiful melodies,

source: །འདི་འདྲའི་སྒྲ་སྐད་སྟོང་སྙེད་དུ། །སྙན་པའི་དབྱངས་སུ་བརྗོད་བྱས་ནས།
en: They sang thousands of such songs.

source: །ལྷའི་བུ་མོ་མྱི་སྨྲ་ཞིང་།
en: Then the goddesses became silent,

source: །ཞི་ལ་དགའ་བར་བདེ་གཤེགས་ལྟ།
en: Gazing peacefully and happily at the Sugata.

source: །རྣམ་ཐར་ཟླ་བ་འཇིགས་མེད་པས།
en: The fearless Mokṣa­candra Questioned the bodhisattva,

source: རྡོ་རྗེའི་སྙིང་པོ་འཇིགས་མྱེད་པ། །རྒྱལ་སྲས་དེ་ལ་ཡང་སྨྲས་པ།
en: Fearless Vajra­garbha:

source: །བཅུ་པར་ཡང་དག་འཕར་བ་ཡི།
en: “Having ascended to the tenth bhūmi, What range of activity, what qualities,

source: །རྣམ་པ་ཡོན་ཏན་སྤྱོད་ཡུལ་དང་། །མཚན་མ་དག་དང་ཆོ་འཕྲུལ་རྣམས།
en: Features, and miraculous powers, are obtained?

source: །མཁས་པས་ཀུན་ཀྱང་བསྟན་པར་མཛོད།
en: May the wise one teach us all.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པའི་བར་དུ་ཤེས་པར་བྱ་བ། ཚད་མེད་པ་ཡོངས་སུ་བརྟགས་པའི་བློས་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། ཆོས་དཀར་པོ་ཤིན་ཏུ་རྫོགས་པ་བསྩགས་པར་བྱ་བའི་ཚོགས་མཐའ་ཡས་པ་ཤིན་ཏུ་བསྩགས་པ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཟིན་པ། སྙིང་རྗེ་ཆེན་པོ་ཤིན་ཏུ་ཡངས་པ་ཐོབ་པ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་རྣམ་པ་ཐ་དད་པ་ལ་མཁས་པ། །སེམས་ཅན་གྱི་ཁམས་ཐིབས་པོས་ཉེ་བར་སྤྱོད་པ་ལ་རབ་ཏུ་ཞུགས་པ། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་འཇུག་པ་དང་ལྡན་པའི་འདུ་ཤེས་དང་། ཡིད་ལ་བྱེད་པ་ཅན་སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ལ་ལྷག་པར་དམིགས་པའི་རྗེས་སུ་སོང་བ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དབང་བསྐུར་བའི་ས་ཐོབ་པ་ཞེས་བྱའོ།
en: In that way the bodhisattva, up through the ninth bodhisattva bhūmi, through the intelligence that examines countless knowables, is said to (1) have analyzed perfectly that which is analyzed, ( ) have perfectly completed the qualities of goodness, (3) have gathered an infinite gathering of the accumulations, (4) possess a great accumulation of merit and wisdom, (5) have attained vast great compassion, (6) know the various different kinds of worlds, (7) act within the complexity of entering the realms of beings, (8) have his attention on the perception of entering the scope of activity of the tathāgatas, (9) be engaged in focusing on the strengths, confidences, and unique buddha qualities, and (10) have attained the bhūmi of the consecration of the totality of omniscient wisdom.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་ཞིང་དབང་བསྐུར་བའི་ས་ཐོབ་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བ་མངོན་དུ་འགྱུར་རོ།
en: “O jinaputras! The bodhisattva who has that kind of wisdom and has attained the bhūmi of consecration manifests the bodhisattva samādhi called stainless

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་ཕྱེ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་དང་། འོད་གཟེར་གྱི་མེ་ཏོག་རྣམ་པ་ཐམས་ཅད་ཅེས་བྱ་བ་དང་། རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། རྒྱ་མཚོའི་རྒྱ་ཞེས་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་ཞེས་བྱ་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པའི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་མངོན་སུམ་དུ་བཞུགས་པ་ཞེས་བྱ་བ་མངོན་དུ་འགྱུར་ཏེ། དེ་ལ་དེ་དག་ལ་སྩོགས་པ་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་ཕྲག་གྲངས་མེད་པ་ཕྲག་བཅུ་མངོན་དུ་འགྱུར་རོ།
en: He manifests the bodhisattva samādhis called entering the analysis of the realm of phenomena, the array of adornments of the regionof enlightenment, the flowers of every kind of light ray, the essence of the ocean, the abundanceof the ocean, the vastness of space, the analysis of the nature of all phenomena, observing the minds and conduct of all beings, being in the presence of all the buddhas of the present, and so on, manifesting countless millions of bodhisattva samādhis.

source: །དེ་ཏིང་ངེ་འཛིན་དེ་དག་ཐམས་ཅད་ལ་མཉམ་པར་གཞོག་ཅིང་རྣམ་པར་ལྡང་ངོ་། །དེ་ཏིང་ངེ་འཛིན་ལ་མཁས་པ་དང་ལྡན་པ་ཡིན་ཏེ། ཏིང་ངེ་འཛིན་གྱི་དགོས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རབ་ཏུ་སྤྱོད་དོ།
en: He enters and comes out of those samādhis, and he has attained skill in samādhi so that he accomplishes all that is to be done through samādhi.

source: །ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་གྲངས་མྱེད་པ་ཕྲག་བཅུའི་ཐ་མ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་གྱིས་མངོན་པར་དབང་བསྐུར་བ་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་མངོན་དུ་འགྱུར་ཏེ།
en: At the conclusion of those countless millions of samādhis he manifests the samādhi called the unique consecration for omniscient wisdom

source: མངོན་དུ་གྱུར་མ་ཐག་ཏུ་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་ཐ་གྲུ་དང་མཉམ་པའི་རིན་པོ་ཆེའི་པད་མོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ་སྤྲས་ཤིང་བརྒྱན་པ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལས་འདས་པ།
en: “As soon as that samādhi manifests, there appears a vast precious lotus the size of a million billion-world universes. It is adorned by every kind of jewel. It transcends that which is experienced in all worlds.

source: འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བས་བྱུང་བ།
en: It has arisen from transcendent roots of goodness.

source: སྒྱུ་མའི་རང་བཞིན་དང་། སྤྱོད་ཡུལ་གྱིས་ཡོངས་སུ་གྲུབ་པ།
en: It is a completely established experience that has the nature of an illusion.

source: ཆོས་ཀྱི་དབྱིངས་ལ་ཤིན་ཏུ་གནས་པར་སྣང་བ་ལྷ་རྫས་ཀྱི་ཡུལ་ལས་ཤིན་ཏུ་འདས་པ།
en: It appears located within the realm of phenomena. It transcends that which is experienced in the divine realms.

source: ནོར་བུ་རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་ཆུ་བ་ཆེན་པོ་ཅན།
en: It has a stem that is a precious great beryl jewel.

source: ཙན་དན་གྱི་རྒྱལ་པོ་མཚུངས་པ་མེད་པའི་སྙིང་པོ་ཅན།
en: It has a pericarp of the unequaled king of sandalwood.

source: ཨ་སྨ་གར་བྷ་རབ་ཀྱི་ཟེ་བ་ཅན།
en: It has emerald anthers.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལྟར་སྣང་བའི་ལོ་མ་ཅན།
en: It has leaves of bright Jambu River gold.

source: འོད་གཟེར་ཚད་མྱེད་པས་ཤིན་ཏུ་རྒྱས་པའི་ལྷུན་ཅན།
en: It has a form that shines with countless light rays.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ནང་ཡོངས་སུ་སྤྲས་པ་རིན་པོ་ཆེ་མུ་མེད་པའི་དྲ་བས་ཀུན་ནས་ཡོག་པ།
en: Its interior is adorned with all the best jewels. It is covered by an endless net of great jewels.

source: སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་འཁོར་དང་ལྡན་པ་འབྱུང་བར་འགྱུར་ཏེ།
en: It has a retinue of great precious lotuses equal in number to the atoms in a million billion-world universes.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལུས་ཀྱང་དེ་དང་རྐྱེན་ཏུ་འཚམ་ཞིང་དེའི་ཚུལ་དང་མཐུན་པར་གནས་སོ།
en: The body of the bodhisattva corresponds to it in size.

source: །དེ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་གྱིས་དབང་བསྐུར་བ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་མ་ཐག་ཏུ་རིན་པོ་ཆེའི་པད་མོའི་རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་འདུག་པར་སྣང་སྟེ།
en: As soon as he attains the samādhi called the unique consecration of omniscient wisdom , he appears seated upon that great precious king of lotuses.

source: རིན་པོ་ཆེའི་པདྨོའི་རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདུག་མ་ཐག་ཏུ་རིན་པོ་ཆེའི་པདྨོའི་རྒྱལ་པོ་ཆེན་པོ་དེའི་འཁོར་རིན་པོ་ཆེའི་པདྨོ་ཇི་སྙེད་བྱུང་བ་དེ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡོངས་སུ་བསྐོར་ཏེ། རིན་པོ་ཆེའི་པད་མོ་དེ་དག་ལ་འཁོད་ནས།
en: The instant the bodhisattva is seated upon that great precious king of lotuses, he is encircled by bodhisattvas upon the lotuses that are the retinue of the great precious king of lotuses, the same in number as those lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་ལ་བལྟ་ཞིང་དེ་དག་རེ་རེ་ཞིང་ཡང་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་བཅུ་ལ་སྙོམས་པར་འཇུག་གོ །བྱང་ཆུབ་སེམས་དཔའ་དེ་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་མཉམ་པར་བཞག་མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མ་ལུས་པར་གཡོ་བར་འགྱུར་རོ། །ངན་སོང་ཐམས་ཅད་རྩེ་ཞིལ་བར་འགྱུར་རོ། །ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་སྣང་བས་རྒྱས་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Each one is gazing at the bodhisattva and rests in a million samādhis.

source: །ཞིང་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་སྒྲ་གྲག་པར་འགྱུར་རོ། །སྐལ་བ་དང་སྤྱོད་པ་མཐུན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་འདུ་བར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ལྷ་དང་མྱིའི་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བའི་སྒྲ་ཡང་འབྱུང་བར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་ཡང་སྐྱེ་བར་འགྱུར་རོ། །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་བསམ་གྱིས་མི་ཁྱབ་པའི་མཆོད་པ་དང་། རིམ་གྲོ་ཡང་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཀྱང་རྣམ་པར་དམིགས་པར་འགྱུར་ཏེ།
en: “The moment the bodhisattva and the other bodhisattvas rest in those samādhis, every world without exception trembles, all lower existences cease, the entire realm of phenomena is filled with radiance, all worlds are purified, the names of all buddha realms resound, all bodhisattvas with the same conduct gather together, there is the sound of divine and human music and song in all worlds, all beings become happy, there occur inconceivable offerings and service to all samyak­sambuddhas, and the assemblies of the followers of all tathāgatas are known.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་རིན་པོ་ཆེའི་པད་མོའི་རྒྱལ་པོ་དེ་ལ་འདུག་མ་ཐག་ཏུ་རྐང་པའི་མཐིལ་གཉིས་ཀྱི་འོག་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་ངོ་།
en: O jinaputras! As soon as the bodhisattva is seated upon that great precious king of lotuses, countless millions of light rays radiate from the soles of his feet.

source: །བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡན་ཅད་སྣང་བར་བྱས་ཏེ། སྡུག་བསྔལ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They radiate, reach, and illuminate the great Avīci hells in the ten directions and end the sufferings of the beings in the hells.

source: །པུས་མོའི་ལྷ་ང་གཉིས་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་བྱུང་སྟེ།
en: “Countless millions of light rays radiate from his knees.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས་སྡུག་བསྔལ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They radiate toward and reach and illuminate all the animal realms in the ten directions and end the suffering of the beings who are animals.

source: །ལྟེ་བའི་དཀྱིལ་འཁོར་ནས་འོད་ཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from his navel.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱས་ནས། སྡུག་བསྔལ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They radiate toward and reach and illuminate all the realms of Yama in the ten directions and end the sufferings of the beings in the realms of Yama.

source: །གཡས་གཡོན་གྱི་རྩིབ་ལོགས་གཉིས་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from his right and left sides.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་མྱིའི་གནས་རྣམས་སྣང་བར་བྱས་ཏེ། སྡུག་བསྔལ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They radiate toward and reach and illuminate all the human realms in the ten directions and end the sufferings of humans.

source: །ལག་པའི་མཐིལ་གཉིས་ནས་འོད་གཟེར བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from the palms of his hands.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་ལྷ་དང་ལྷ་མ་ཡིན་གྱི་གནས་རྣམས་སྣང་བར་བྱས་ནས། སྡུག་བསྔལ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They radiate toward and reach and illuminate all the realms of devas and asuras in the ten directions and end the suffering of the devas and asuras.

source: །ཕྲག་པ་གཉིས་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from his shoulders.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་གནས་སྣང་བར་བྱས་ནས། ཆོས་སྣང་བའི་སྒོ་ཡང་ཉེ་བར་སྒྲུབ་བོ།
en: They radiate toward and reach and illuminate all those who are in the Śrāvaka­yāna in the ten directions, and they create entrances into the radiance of the Dharma.

source: །རྒྱབ་དང་མགུལ་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from his back and throat.

source: བྱུང་ནས་ཀྱང་རང་སངས་རྒྱས་ཀྱི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས་ཞི་བའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་གྱི་སྒོའང་ཉེ་བར་སྒྲུབ་བོ།
en: They radiate toward and reach and illuminate all those who are in the Pratyeka­buddha­yāna in the ten directions and create the entrances to the peace of samādhi.

source: །ཁའི་སྒོ་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from his mouth.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་བ་ཡན་ཅད་ས་དགུ་པ་ཐོབ་པའི་བར་དག་སྣང་བར་བྱས་ནས། ཤེས་རབ་དང་ཐབས་ཀྱི་ཚུལ་གྱི་སྒོ་ཡང་ཉེ་བར་སྒྲུབ་བོ།
en: They radiate toward and reach and illuminate all those bodhisattvas in the ten directions, from those who have just developed bodhicitta up to those who have attained the ninth bhūmi, and they create entrances to the way of wisdom and method.

source: །སྨྱིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་འོད་གཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་འབྱུང་སྟེ།
en: “Countless millions of light rays radiate from the ūrṇā hair between his brows.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་བདུད་ཀྱི་གནས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ། དབང་བསྐུར་བའི་ས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྣང་བར་བྱས་ནས། དེ་དག་གི་ལུས་སུ་ནུབ་པར་འགྱུར་རོ།
en: They radiate toward and reach and illuminate all the dwellings of the māras and darken them, and then they illuminate those bodhisattvas in the ten directions who have attained the bhūmi of consecration and enter their bodies.

source: །ཡན་ལག་དམ་པའི་སྤྱི་གཙུག་ནས་འོད་གཟེར་སྟོང་གསུམ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འབྱུང་སྟེ།
en: “Light rays as numerous as the atoms in countless millions of worlds radiate from the top of his head.
